blogger/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "dog1.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 194778], ["updated_at", "2015-11-16 16:22:39.861345"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)