blogger/app/controllers/tags_controller.rb

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 2]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    Tag.find(params[:id]).destroy